## 🏗️ Terraform Plan Summary

**Environment:** 🧪 `dev`

| Step | Status |
|------|:------:|
| 🖌 Format & Style | ✅ `success` |
| ⚙️ Initialization | ✅ `success` |
| 🤖 Validation | ✅ `success` |
| 📖 Plan | ✅ `success` |

<details><summary>Plan Output</summary>

```terraform
data.terraform_remote_state.main: Reading...
random_id.bucket_suffix: Refreshing state... [id=usTc4Q]
google_service_account.app: Refreshing state... [id=projects/doug-hayden-eng-sandbox/serviceAccounts/agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_vertex_ai_reasoning_engine.session_and_memory: Refreshing state... [id=projects/doug-hayden-eng-sandbox/locations/us-central1/reasoningEngines/8356485183678971904]
google_storage_bucket.artifact_service: Refreshing state... [id=agent-foundation-dev-artifact-service-bac4dce1]
data.terraform_remote_state.main: Read complete after 0s
google_project_iam_member.app["roles/storage.objectUser"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/storage.objectUser/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/cloudtrace.agent"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/cloudtrace.agent/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/logging.logWriter"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/logging.logWriter/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/storage.bucketViewer"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/storage.bucketViewer/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/serviceusage.serviceUsageConsumer"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/serviceusage.serviceUsageConsumer/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/aiplatform.user"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/aiplatform.user/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/telemetry.tracesWriter"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/telemetry.tracesWriter/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_cloud_run_v2_service.app["us-central1"]: Refreshing state... [id=projects/doug-hayden-eng-sandbox/locations/us-central1/services/agent-foundation-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_cloud_run_v2_service.app["us-central1"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_cloud_run_v2_service" "app" {
      + annotations             = (known after apply)
      + binary_authorization    = (known after apply)
      + build_config            = (known after apply)
      + client                  = (known after apply)
      + client_version          = (known after apply)
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + custom_audiences        = (known after apply)
      + default_uri_disabled    = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = (known after apply)
      + description             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + invoker_iam_disabled    = (known after apply)
      + labels                  = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + multi_region_settings   = (known after apply)
      + name                    = "agent-foundation-dev"
      + observed_generation     = (known after apply)
      + reconciling             = (known after apply)
      + scaling                 = (known after apply)
      + template                = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic                 = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)
    }

  # google_cloud_run_v2_service.app["us-central1"] will be updated in-place
  ~ resource "google_cloud_run_v2_service" "app" {
        id                      = "projects/doug-hayden-eng-sandbox/locations/us-central1/services/agent-foundation-dev"
        name                    = "agent-foundation-dev"
        # (34 unchanged attributes hidden)

      ~ template {
            # (11 unchanged attributes hidden)

          ~ containers {
              ~ image          = "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/agent-foundation-dev/agent-foundation@sha256:ea481ab383ed0b0bc9196c0e87403b66d8385d4d08ebe35adcc6a30c41a3ca31" -> "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/agent-foundation-dev/agent-foundation@sha256:6c96efbae3be2bc2f11cbf32207564a3737fa54338b14e3289ffa50349602f63"
                name           = null
                # (6 unchanged attributes hidden)

              - env {
                  - name  = "AGENT_ENGINE" -> null
                  - value = "projects/doug-hayden-eng-sandbox/locations/us-central1/reasoningEngines/8356485183678971904" -> null
                }
              + env {
                  + name  = "AGENT_ENGINE"
                  + value = (known after apply)
                }

                # (16 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_vertex_ai_reasoning_engine.session_and_memory must be replaced
-/+ resource "google_vertex_ai_reasoning_engine" "session_and_memory" {
      ~ create_time  = "2026-02-18T04:30:37.280310Z" -> (known after apply)
      ~ id           = "projects/doug-hayden-eng-sandbox/locations/us-central1/reasoningEngines/8356485183678971904" -> (known after apply)
      ~ name         = "8356485183678971904" -> (known after apply)
      + region       = "us-central1" # forces replacement
      ~ update_time  = "2026-02-18T04:31:30.171182Z" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ agent_engine                     = "projects/doug-hayden-eng-sandbox/locations/us-central1/reasoningEngines/8356485183678971904" -> (known after apply)
  ~ cloud_run_services               = {
      ~ us-central1 = {
          ~ latest_ready_revision = "agent-foundation-dev-00011-d2j" -> (known after apply)
          ~ update_time           = "2026-02-20T21:28:57.484183Z" -> (known after apply)
          ~ uri                   = "https://agent-foundation-dev-645mxjt3sq-uc.a.run.app" -> (known after apply)
        }
    }
  ~ configured_environment_variables = {
      ~ AGENT_ENGINE                                       = "projects/doug-hayden-eng-sandbox/locations/us-central1/reasoningEngines/8356485183678971904" -> (known after apply)
        # (13 unchanged attributes hidden)
    }
  ~ deployed_image                   = "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/agent-foundation-dev/agent-foundation@sha256:554bd7c90c51af2a522d95428a086d8da4e8c6a2a8675b679132e70a632013a5" -> "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/agent-foundation-dev/agent-foundation@sha256:6c96efbae3be2bc2f11cbf32207564a3737fa54338b14e3289ffa50349602f63"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan-dev

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan-dev"
```

</details>

---